app/controllers/microposts_controller.rb

  def index
    # last = params[:last].blank? ? Time.now + 1.second :
    #    Time.parse(params[:last])
    #    @microposts = Micropost.feed(last)
    # @microposts = Micropost.order("comments_count DESC").page(params[:page]).per_page(1)
    # @all_microposts = Micropost.all
    @micropost = Micropost.new
    @all_microposts = Micropost.search(params[:search])
---
SELECT "microposts".* FROM "microposts" ORDER BY microposts.created_at DESC

  def show
    @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]

  def display
    @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "59"]]

  def create
    @micropost = Micropost.new(params[:micropost])

    if @micropost.to_guys = params["commit"] == "to Guys"
       @micropost.to_guys = true
          flash[:notice] = "to Guys was clicked and the boolean is updated"
       else
          @micropost.to_guys = false
       end

    if @micropost.save
---
INSERT INTO "microposts" ("approved", "content", "created_at", "flag", "liked", "tag", "to_guys", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]

  def update
    @micropost = Micropost.find(params[:id])



    if params['commit'] == "to Guys"
       @micropost.update_attribute(:to_guys, true)
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]
UPDATE "microposts" SET "content" = 'Kungu Panda Dodo', "updated_at" = '2012-02-25 22:32:21.576283' WHERE "microposts"."id" = 1

  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "19"]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 19]]