app/controllers/pages_controller.rb

SELECT "microposts".* FROM "microposts" ORDER BY microposts.created_at DESC, created_at LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "microposts"
---
  def index
    @fb_app_id ="109989265800865"
    @fb_admins ="500208454"
    @og_title ="HelpMeDateYou.com"
    @og_url="http://helpmedateyou.com"
    @og_description ="Share avice anonymously with guys and girls"
    @og_type ="website"
    @og_image ="http://i.imgur.com/Mij1Q.png"
    @og_site_name ="HelpMeDateYou.com | Share avice anonymously with guys and girls"

    @title = "Home"
    #@microposts = Micropost.paginate(:page => params[:page], :per_page => 20).order('comments_count DESC, created_at DESC')

    # searching
    @microposts = Micropost.order("created_at DESC").search(params[:search], params[:page])